#Область Конструктор

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Перем МакетHTML,   сПутьКФайлу;
	Перем элементScript, документHTML, сТекстДокументаHTML;
		
	ОО = РеквизитФормыВЗначение("Объект");
	МакетHTML = ОО.ПолучитьМакет("HTML_DOC");
	документHTML = МакетHTML.ПолучитьДокументHTML();
	
	Если НЕ ПодключитьCSS_кHTMLДокументу(документHTML, "STYLE") Тогда
		СообщитьПользователю("Ошибка подключения скрипта ""Showdown"" к HTML документу.");
		Отказ = Истина;	
	КонецЕсли; 
		
	Если НЕ ПодключитьСкрипт_кHTMLДокументу(документHTML, "Showdown") Тогда
		СообщитьПользователю("Ошибка подключения скрипта ""Showdown"" к HTML документу.");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ПодключитьСкрипт_кHTMLДокументу(документHTML, "MD_Convert") Тогда
		СообщитьПользователю("Ошибка подключения скрипта ""MD_Convert"" к HTML документу.");
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ТекстHTMLДокумента(документHTML, сТекстДокументаHTML) Тогда
		СообщитьПользователю("Ошибка получения текста HTML документа.");
		Отказ = Истина;
	КонецЕсли;	
	
	ЭтотОбъект.HTML_Fild = сТекстДокументаHTML;
	
КонецПроцедуры

#КонецОбласти

#Область Команды_формы

&НаКлиенте
Процедура ЗагрузитьТестовыйMD(Команда)
	Перем сТекстMD, документHTML;
	
	сТекстMD = ТекстMDДокумента("MD_Sample");
	документHTML = Элементы.HTML_Fild.Документ;
	документHTML.getElementById("sourceTA").innerHTML = сТекстMD;

КонецПроцедуры

#КонецОбласти

#Область Служебные_методы

&НаСервере
Функция ПодключитьCSS_кHTMLДокументу(документHTML, Знач сИмяМакетаCSS)
	Перем ОО, бВыполненоБезОшибок, сПутьКФайлу, макетCSS, элементыCSS, элементCSS;
	
	бВыполненоБезОшибок = Ложь;
	ОО = РеквизитФормыВЗначение("Объект");
	
	сПутьКФайлу = ПолучитьИмяВременногоФайла("css");
	макетCSS = ОО.ПолучитьМакет(сИмяМакетаCSS);
	макетCSS.Записать(сПутьКФайлу);
	
	элементыCSS = документHTML.ПолучитьЭлементыПоИмени("link");
	
	Если элементыCSS.Количество() = 0 Тогда
		Возврат бВыполненоБезОшибок;
	КонецЕсли;
	
	Для каждого элементCSS Из элементыCSS Цикл
		Если элементCSS.Отношение = "stylesheet" Тогда
			элементCSS.УстановитьАтрибут("href", ПутьКФайлуКакURL(сПутьКФайлу));
			бВыполненоБезОшибок = Истина;
			Возврат бВыполненоБезОшибок;
		КонецЕсли;		
	КонецЦикла; 

	Возврат бВыполненоБезОшибок;
КонецФункции

&НаСервере
Функция ПодключитьСкрипт_кHTMLДокументу(документHTML, Знач сИмяМакетаСкрипта)
	Перем ОО, сПутьКФайлу, макетJS, элементScript, элементыScript;
	Перем бВыполненоБезОшибок;
	
	бВыполненоБезОшибок = Ложь;
	ОО = РеквизитФормыВЗначение("Объект");
	
	сПутьКФайлу = ПолучитьИмяВременногоФайла("js");
	макетJS = ОО.ПолучитьМакет(сИмяМакетаСкрипта);
	макетJS.Записать(сПутьКФайлу);
	
	элементыScript = документHTML.ПолучитьЭлементыПоИмени("script");
	Если элементыScript.Количество() = 0 Тогда
		Возврат бВыполненоБезОшибок;
	КонецЕсли;
	
	Для каждого элементScript Из элементыScript Цикл
		Если элементScript.Источник = сИмяМакетаСкрипта Тогда
			элементScript.УстановитьАтрибут("src", ПутьКФайлуКакURL(сПутьКФайлу));
			бВыполненоБезОшибок = Истина;
			Возврат бВыполненоБезОшибок;
		КонецЕсли;
	КонецЦикла;
	
	Возврат бВыполненоБезОшибок;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ПутьКФайлуКакURL(сПуть)
	Возврат "file:///"+СокрЛП(СтрЗаменить(сПуть,"\","/"));
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ТекстHTMLДокумента(Знач документHTML, сТекстДокументаHTML)
	Перем бВыполненоБезОшибок, ЗаписьDOM, ЗаписьHTML;
	
	ЗаписьDOM = Новый ЗаписьDOM();
	ЗаписьHTML = Новый ЗаписьHTML();
	ЗаписьHTML.УстановитьСтроку();
	Попытка
		ЗаписьDOM.Записать(документHTML, ЗаписьHTML);
		сТекстДокументаHTML = ЗаписьHTML.Закрыть();
		бВыполненоБезОшибок = Истина;
	Исключение
		сТекстДокументаHTML = "";
	    бВыполненоБезОшибок = Ложь;
	КонецПопытки;
	
	Возврат бВыполненоБезОшибок;
КонецФункции

&НаСервере
Функция ТекстMDДокумента(сИмяМакетаMD)
	Перем ОО, макетMD, сТекстMD;
	
	ОО = РеквизитФормыВЗначение("Объект");
	макетMD = ОО.ПолучитьМакет(сИмяМакетаMD);
	сТекстMD = макетMD.ПолучитьТекст();
	
	Возврат сТекстMD;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(сТекстСообщения)
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = сТекстСообщения;
	Сообщение.Сообщить();
КонецПроцедуры

#КонецОбласти
